{
    "session_id": "session_68fea2af608868.05786025",
    "created_at": 1761518255,
    "status": "initialized",
    "total_sources": 10,
    "processed": 9,
    "sources": [
        {
            "index": 0,
            "text": "The Best Ever Mexican Birria We’re cooking up a flavorful Mexican meat stew in the Chili Pepper Madness kitchen, my friends. It’s called Birria, and you’re going to want to make this right away. This birria recipe is an iconic meat stew from the Mexican state of Jalisco of lamb, goat or beef cooked low and slow in a seasoned chili sauce. Serve it in a bowl or as birria tacos.",
            "status": "processing",
            "result": null,
            "error": null,
            "started_at": 1761518255,
            "completed_at": null
        },
        {
            "index": 1,
            "text": "Prize-Winning Pumpkin Chili for a Cozy Halloween Dinner Serve up a bowl of prize-winning comfort with this hearty Pumpkin Chili—perfect for a Halloween dinner before trick-or-treating or your next fall gathering. This spicy, savory chili recipe includes Italian sausage, black beans, fire-roasted tomatoes, and velvety pumpkin puree for a rich and cozy texture. Ideal for game nights, family feasts, or your Halloween party food table, it’s easy to make and packed with fall flavors everyone loves",
            "status": "completed",
            "result": {
                "success": true,
                "slug": "prize-winning-pumpkin-chili",
                "title": "Prize-Winning Pumpkin Chili",
                "images_count": 4,
                "message": "Recette créée avec succès"
            },
            "error": null,
            "started_at": 1761518385,
            "completed_at": 1761518499
        },
        {
            "index": 2,
            "text": "Eddie's Award Winning Chili 262 ratings · 3hr 45min · 10 servings A fantastic award winning chili con carne with a robust meaty flavor, the perfect amount of heat, beef, pork, beans, fresh chile peppers, awesome spices, onions, garlic, tomatoes and beer.",
            "status": "completed",
            "result": {
                "success": true,
                "slug": "eddie-s-award-winning-chili",
                "title": "Eddie's Award Winning Chili",
                "images_count": 4,
                "message": "Recette créée avec succès"
            },
            "error": null,
            "started_at": 1761518503,
            "completed_at": 1761518609
        },
        {
            "index": 3,
            "text": "Green Chili Stew With Pork It's time for some stew, my friends! But not just ANY stew. Today we're cooking up a super flavorful, beautiful pot of Green Chili Stew that is destined to become one of your new favorite recipes. This green chili stew recipe is made with lots of roasted green chilies, potatoes and tender chunks of pork simmered low and slow until perfect. So easy!",
            "status": "completed",
            "result": {
                "success": true,
                "slug": "green-chili-stew-with-pork",
                "title": "Green Chili Stew With Pork",
                "images_count": 4,
                "message": "Recette créée avec succès"
            },
            "error": null,
            "started_at": 1761518612,
            "completed_at": 1761518714
        },
        {
            "index": 4,
            "text": "White Chicken Chili 35 min · Gluten free · 6 servings White Chicken Chili is a warm and hearty dish perfect for cozy nights or when you're looking for something comforting yet different from the classic red chili. Creamy, flavorful, and packed with tender chicken, beans, and a subtle kick of spice, it’s a recipe you'll turn to again and again.",
            "status": "completed",
            "result": {
                "success": true,
                "slug": "white-chicken-chili",
                "title": "White Chicken Chili",
                "images_count": 4,
                "message": "Recette créée avec succès"
            },
            "error": null,
            "started_at": 1761518717,
            "completed_at": 1761518827
        },
        {
            "index": 5,
            "text": "Chili Colorado Recipe Chili Colorado is a traditional Mexican recipe of pork or beef stewed low and slow in a rich red chili sauce, hence the name \"colorado\", which means \"colored red\", not from the state of Colorado.      Save Recipe  Course: Main Course Cuisine: American, Mexican Keyword: chili, one pot, slow cooker  Prep Time: 25minutes minutes Cook Time: 40minutes minutes Total Time: 1hour hour 5minutes minutes  Calories: 344kcal  Author: Mike Hultquist Servings: 8 Tap or hover to scale 4.96 from 103 votes Leave a Review   Ingredients FOR THE SAUCE 6 ancho chili peppers stemmed and seeded 6 guajillo peppers stemmed and seeded 2 pasilla peppers stemmed and seeded 3 chiles de arbol stemmed and seeded 1 tablespoon Mexican oregano 1 teaspoon cumin Salt and pepper to taste FOR THE CHILI 2 tablespoons olive oil 1 small onion chopped 2 jalapeno peppers chopped (optional – I like the extra heat and flavor) 4-5 cloves garlic chopped 2.5 pounds beef chuck roast cut into bite-sized chunks ¼ cup flour Salt and pepper to taste 2 cups beef stock chicken or vegetable stock are good, too FOR SERVING: Crumbly white cheese, fresh herbs, spicy chili flakes, squeeze of lime juice if desired – Rice and\/or warmed tortillas, if desired Instructions Make the sauce first by dry toasting the dried peppers in pan about a minute per side, until the skins blister a bit. Set them into a bowl and cover with hot water for 20 minutes, until they are very soft. Transfer the peppers to a blender with oregano, cumin, a bit of salt and pepper, and 1 cup of the soaking water. Blend until nice and smooth. Strain the sauce and set aside. Heat the olive oil in a large pot or Dutch oven to medium high heat. Toss the cubed chuck roast in the flour with a bit of salt and pepper to coat them. Brown the beef on all sides, about 5 minutes. Remove to a plate and set aside. Reduce the heat to medium heat. Add the onion and peppers and cook until softened, about 5 minutes. Add the garlic and cook 1 minute, stirring a bit. Add the red chili sauce and stock and bring to a boil. Add the browned meat back to the pot. Reduce the heat, cover, and simmer for at least 30 minutes to let the flavors develop. Longer is better, 2 hours or more for melt-in-your-mouth tender beef. If you’d like to thicken the chili, remove the cover and increase the heat. Cook until the moisture cooks out and your preferred thickness is achieved.",
            "status": "completed",
            "result": {
                "success": true,
                "slug": "chili-colorado",
                "title": "Chili Colorado",
                "images_count": 4,
                "message": "Recette créée avec succès"
            },
            "error": null,
            "started_at": 1761518831,
            "completed_at": 1761518931
        },
        {
            "index": 6,
            "text": "Best Chili 7 ratings · 8hr 30min · 12 servings The best chili recipe ever to come from my kitchen, guys! I know, I know, it's a huge claim. I think I'm picky about chili. This recipe has 2 things that make it unique: tender, fall-apart shredded beef instead of ground beef, and Mexican Masa Harina. The smell of this chili simmering may actually knock you out.",
            "status": "completed",
            "result": {
                "success": true,
                "slug": "best-chili",
                "title": "Best Chili",
                "images_count": 4,
                "message": "Recette créée avec succès"
            },
            "error": null,
            "started_at": 1761518934,
            "completed_at": 1761519023
        },
        {
            "index": 7,
            "text": "Award Winning Turkey Chili 1hr 5min · Gluten free This Award Winning Turkey Chili is a perfect combination of bold flavors and comforting warmth. Packed with lean turkey, hearty beans, and a blend of spices, it’s the ultimate dish for cozy dinners or meal prep. Whether you’re hosting a gathering or enjoying a quiet night in, this turkey chili recipe will satisfy your cravings. Easy to make and full of nutrients, it's sure to become a family favorite. Try it today and elevate your chili game to the next level!",
            "status": "completed",
            "result": {
                "success": true,
                "slug": "award-winning-turkey-chili",
                "title": "Award Winning Turkey Chili",
                "images_count": 4,
                "message": "Recette créée avec succès"
            },
            "error": null,
            "started_at": 1761519026,
            "completed_at": 1761519127
        },
        {
            "index": 8,
            "text": "This easy Crockpot Chili recipe has dozens of 5-star reviews and has been awarded “winner” in multiple chili cook-offs!",
            "status": "completed",
            "result": {
                "success": true,
                "slug": "easy-crockpot-chili",
                "title": "Easy Crockpot Chili",
                "images_count": 4,
                "message": "Recette créée avec succès"
            },
            "error": null,
            "started_at": 1761519130,
            "completed_at": 1761519231
        },
        {
            "index": 9,
            "text": "World's Best Chili 7 ratings · 8hr 20min · Gluten free · 12 servings Best EVER chili! This is our favorite chili recipe of all time. We make this delicious soup multiple times every winter.",
            "status": "completed",
            "result": {
                "success": true,
                "slug": "world-s-best-chili",
                "title": "World's Best Chili",
                "images_count": 4,
                "message": "Recette créée avec succès"
            },
            "error": null,
            "started_at": 1761519235,
            "completed_at": 1761519330
        }
    ]
}