{
    "title": "Cherry Martini Recipes for Your Next Gathering",
    "voice": "Enthusiastic Friend",
    "promptIMG": "Professional food photography prompt: \"Cherry martini, elegantly served in a chilled glass, garnished with fresh cherries and a twist of citrus, natural food photography, balanced sharp focus throughout entire image, zero blur, infinite depth of field, realistic drink textures, modern kitchen background in sharp focus, natural window lighting, kitchen countertop visible, even focus distribution, documentary food photography style, professional food styling, appetizing presentation --no blur, depth of field, bokeh, over-sharpening, artificial enhancement --quality 2 --ar 4:3 --stylize 300\"",
    "isOnline": true,
    "description": "These cherry martinis are a fun twist on classic cocktails! Made with fresh cherries, smooth vodka, and a splash of citrus, they bring a burst of flavor to any occasion. Shake one up for your next get-together and watch everyone enjoy. Don't forget to save this recipe for later!",
    "hashtags": "#cherrymartini #cocktailrecipes #easyrecipes #mixology #partytime",
    "difficulty": "Easy",
    "prep_time": 10,
    "cook_time": 0,
    "servings": 4,
    "ingredients": [
        "1 cup fresh cherries, pitted",
        "1/2 cup vodka",
        "1/4 cup cherry liqueur",
        "1 tablespoon fresh lemon juice",
        "Ice cubes",
        "Fresh cherries and lemon twists for garnish"
    ],
    "instructions": [
        "Start by pitting the fresh cherries and placing them in a cocktail shaker. Muddle them gently to release their juices.",
        "Add the vodka, cherry liqueur, and fresh lemon juice to the shaker. Fill it with ice cubes.",
        "Shake vigorously for about 15 seconds until well chilled.",
        "Strain the mixture into chilled martini glasses, ensuring no cherry bits make it through.",
        "Garnish each drink with a fresh cherry and a twist of lemon peel for a pop of color and flavor."
    ],
    "tips": "When making these cherry martinis, here are some pro tips to keep in mind: 1. **Use fresh cherries**: They make a huge difference in flavor. Look for ones that are firm and bright in color. 2. **Chill your glasses**: Pop your martini glasses in the freezer for a few minutes before serving. It keeps your drink colder longer. 3. **Adjust sweetness**: If you prefer a sweeter drink, add a splash of simple syrup. Just mix equal parts sugar and water until dissolved. 4. **Experiment with flavors**: Try adding a splash of orange liqueur for a different twist. 5. **Batch it up**: If you're hosting, make a larger batch in a pitcher. Just multiply the ingredients and stir instead of shaking.",
    "category_id": "cat_1761230294_638",
    "image_keywords": [
        "appetizing",
        "colorful",
        "refreshing",
        "cocktail",
        "party"
    ],
    "structured_content": [
        {
            "content": "<p>Cherry martinis are one of those drinks that looks fancy but is actually super easy to make. Fresh cherries, vodka, a little lemon juice. That's basically it. Takes like 10 minutes and everyone thinks you're some kind of mixology expert. Perfect for when you want to impress people without actually trying that hard.</p><p>I started making these at parties because regular martinis felt boring. Wanted something with color and flavor that looked good in photos. These definitely deliver on all counts. Plus they taste way better than those neon colored cocktails from a mix.</p>"
        },
        {
            "note": {
                "label": "Why This Works",
                "content": "<ul><li>Takes 10 minutes which is faster than going to a bar</li><li>Fresh cherries make it taste real not artificial</li><li>Perfect for summer parties or girls night or whenever</li><li>Everyone likes martinis and everyone likes cherries</li><li>Looks really pretty which matters for party drinks</li></ul>"
            }
        },
        {
            "content": "<p>First time I tried a cherry martini was at my friend's birthday party. It was bright red and looked amazing. Tasted even better. Sweet but not too sweet with that vodka kick. I asked her how to make it and she said it was way easier than I thought. Been making them ever since.</p>"
        },
        {
            "content": "<p>My first attempt at making these was kind of a mess. Used frozen cherries because that's what I had. Drink came out watery and tasted like nothing. Learned real quick that fresh cherries are worth the extra money. Makes a huge difference in flavor.</p>"
        },
        {
            "headline": "What You Need"
        },
        {
            "content": "<ul><li><strong>Fresh cherries:</strong> Get the dark red ones that are firm and ripe. Not mushy. You need to pit them which is annoying but necessary. Worth it for the flavor.</li><li><strong>Vodka:</strong> Use decent vodka. Doesn't have to be top shelf but don't use the cheap stuff either. Middle shelf vodka works perfect. Grey Goose or Tito's are good choices.</li><li><strong>Cherry liqueur:</strong> This adds extra cherry flavor and sweetness. I use whatever's on sale honestly. They all taste pretty similar.</li><li><strong>Lemon juice:</strong> Fresh squeezed is best. Cuts through the sweetness and makes it taste less like candy. Bottled lemon juice works in a pinch though.</li><li><strong>Ice:</strong> Lots of ice. Need it cold. That's the whole point of shaking it.</li><li><strong>Cocktail shaker:</strong> Essential for mixing everything. You can use a mason jar with a lid if you don't have a shaker. Works the same.</li></ul>"
        },
        {
            "content": "<p>Don't skip the fresh cherries. I know they're more work but frozen ones make it taste watered down. Trust me on this one. I learned the hard way. Also chill your glasses ahead of time. Makes the drink stay cold longer and look more professional.</p>"
        },
        {
            "upload": {
                "context": "Fresh cherries, vodka, cherry liqueur, and lemon juice arranged on a marble counter for cocktail preparation.",
                "url": "sweet-tangy-cherry-martini-recipes-for-cocktail-lovers/images/sweet-tangy-cherry-martini-recipes-for-cocktail-lovers_image_1.webp"
            }
        },
        {
            "headline": "How to Make It"
        },
        {
            "content": "<p>Pit your cherries first. This is the most annoying part but you gotta do it. Put them in your cocktail shaker and mash them up a bit with a muddler or the back of a spoon. You want to get the juice out but not turn them into complete mush.</p><p>Add the vodka, cherry liqueur, and lemon juice. Fill the shaker with ice. Put the lid on tight and shake it hard for like 15 seconds. You want it really cold. You'll feel the outside of the shaker get cold which means it's working.</p><p>Strain it into your chilled martini glasses. Make sure you get all the cherry chunks out. Nobody wants to chew their drink. Stick a fresh cherry on the rim and add a twist of lemon peel. That's it. You're done.</p>"
        },
        {
            "content": "<p>The muddling part is important. Don't skip it or go too light. You need to actually crush the cherries to get their flavor out. But don't go crazy and turn them into juice. Just rough them up enough to release the good stuff.</p>"
        },
        {
            "upload": {
                "context": "Shaking fresh cherry martini ingredients in a cocktail shaker on a kitchen countertop.",
                "url": "sweet-tangy-cherry-martini-recipes-for-cocktail-lovers/images/sweet-tangy-cherry-martini-recipes-for-cocktail-lovers_image_2.webp"
            }
        },
        {
            "note": {
                "label": "Don't Forget",
                "content": "<ul><li>Keep everything cold. Vodka in the freezer, glasses in the freezer, ice everywhere.</li><li>Don't skip muddling the cherries or your drink will be boring.</li><li>Shake it hard for at least 15 seconds. Weak shaking means a warm drink.</li><li>These don't keep well so just make what you'll drink right away.</li><li>If you somehow have leftovers put them in the fridge but drink within a day.</li></ul>"
            }
        },
        {
            "content": "<p>Every time I make these for friends they want the recipe. I'm like it's literally just cherries and vodka in a shaker. But people are impressed anyway. I think it's because they look fancy with the garnish and the pretty color. Sometimes presentation is everything.</p>"
        },
        {
            "content": "<p>Leftovers aren't really a thing with cocktails. You drink them fresh or not at all. These get watered down if you try to save them. Just make a new batch if you want more. It only takes 10 minutes anyway.</p>"
        },
        {
            "headline": "Making It Taste Better"
        },
        {
            "content": "<p>Fresh mint is really good in these. Just slap a mint leaf between your hands before adding it to release the oils. Makes it taste more refreshing and smell amazing. Plus it looks pretty floating in the drink.</p>"
        },
        {
            "content": "<p>A tiny pinch of cinnamon sounds weird but it works. Adds warm depth without making it taste like Christmas. Just a tiny bit though. Too much and it's ruined. Like barely any cinnamon.</p>"
        },
        {
            "content": "<p>Prosecco or champagne makes it bubbly and fancy. Just top off each glass with a splash. Turns it into more of a celebratory drink. Good for special occasions or when you want to feel fancy on a Tuesday.</p>"
        },
        {
            "headline": "What to Eat With It"
        },
        {
            "content": "<p>Light appetizers work best. Bruschetta, cheese and crackers, that kind of stuff. Nothing too heavy because these drinks are sweet. You don't want to fill up on food and then feel sick from the sugar.</p>"
        },
        {
            "content": "<p>Sparkling water on the side is smart. Helps you pace yourself and stay hydrated. Nobody wants a hangover from cherry martinis. That's embarrassing. Alternate between cocktails and water.</p>"
        },
        {
            "content": "<p>Crusty bread or breadsticks for nibbling. Gives you something to do between drinks. Also soaks up some of the alcohol so you don't get too drunk too fast. Smart party planning right there.</p>"
        },
        {
            "headline": "Different Ways to Do It"
        },
        {
            "content": "<p>These are already gluten free so that's easy. Just make sure your vodka is gluten free if you're really sensitive. Most vodka is fine but some people are picky about it. Better safe than sorry.</p>"
        },
        {
            "content": "<p>For a frozen version blend everything with ice instead of shaking. Makes it like a cherry slushy for adults. Really good on hot days when you want something cold and strong. Changes the whole vibe of the drink.</p>"
        },
        {
            "content": "<p>Gin instead of vodka gives it a different flavor. More herbal and complex. I like it but some people think it's weird. Try it both ways and see what you prefer. Gin martinis are a whole different thing.</p>"
        },
        {
            "upload": {
                "context": "Chilled cherry martinis garnished with fresh cherries and lemon twists on a rustic wooden table.",
                "url": "sweet-tangy-cherry-martini-recipes-for-cocktail-lovers/images/sweet-tangy-cherry-martini-recipes-for-cocktail-lovers_image_3.webp"
            }
        },
        {
            "note": {
                "label": "Extra Stuff",
                "content": "<ul><li>Use a fine strainer when pouring so you don't get cherry chunks in the drink.</li><li>Muddle gently not aggressively. You want juice not cherry sauce.</li><li>Prep your garnishes before you start making drinks so you're not scrambling.</li><li>Sugar rim the glasses if you want them sweeter and prettier.</li><li>Make a big batch in a pitcher if you're hosting a party. Way easier.</li></ul>"
            }
        },
        {
            "content": "<p>For parties I make these in a big pitcher instead of individually. Just multiply everything by however many people you're serving. Mix it all up and keep it in the fridge. Pour over ice when people want drinks. Way less work than making each one separately.</p>"
        },
        {
            "content": "<p>If you mess up and it's too sweet add more lemon juice. Too tart add simple syrup. Too strong add more cherry liqueur. You can always adjust as you go. That's the nice thing about cocktails. Hard to completely ruin them.</p>"
        },
        {
            "content": "<p>Cherry martinis are perfect party drinks. They look impressive, taste good, and are easy to make. Everyone always wants one when they see how pretty they are. That's what you want from a cocktail. Something that tastes as good as it looks.</p>"
        },
        {
            "content": "<p>Make these for your next gathering. People will be impressed even though it took you like 10 minutes. Sometimes the simplest things are the best. Plus you get to eat cherries while you make them which is a bonus.</p>"
        }
    ],
    "author_id": "author_001",
    "images": [
        {
            "fileName": "sweet-tangy-cherry-martini-recipes-for-cocktail-lovers_image_1.webp",
            "filePath": "recipes/sweet-tangy-cherry-martini-recipes-for-cocktail-lovers/images/sweet-tangy-cherry-martini-recipes-for-cocktail-lovers_image_1.webp",
            "relativePath": "sweet-tangy-cherry-martini-recipes-for-cocktail-lovers/images/sweet-tangy-cherry-martini-recipes-for-cocktail-lovers_image_1.webp",
            "originalUrl": "http://localhost/SitePinterset/mollykitchendaily-main/tmpIMG/image_1.webp",
            "order": 1
        },
        {
            "fileName": "sweet-tangy-cherry-martini-recipes-for-cocktail-lovers_image_2.webp",
            "filePath": "recipes/sweet-tangy-cherry-martini-recipes-for-cocktail-lovers/images/sweet-tangy-cherry-martini-recipes-for-cocktail-lovers_image_2.webp",
            "relativePath": "sweet-tangy-cherry-martini-recipes-for-cocktail-lovers/images/sweet-tangy-cherry-martini-recipes-for-cocktail-lovers_image_2.webp",
            "originalUrl": "http://localhost/SitePinterset/mollykitchendaily-main/tmpIMG/image_2.webp",
            "order": 2
        },
        {
            "fileName": "sweet-tangy-cherry-martini-recipes-for-cocktail-lovers_image_3.webp",
            "filePath": "recipes/sweet-tangy-cherry-martini-recipes-for-cocktail-lovers/images/sweet-tangy-cherry-martini-recipes-for-cocktail-lovers_image_3.webp",
            "relativePath": "sweet-tangy-cherry-martini-recipes-for-cocktail-lovers/images/sweet-tangy-cherry-martini-recipes-for-cocktail-lovers_image_3.webp",
            "originalUrl": "http://localhost/SitePinterset/mollykitchendaily-main/tmpIMG/image_3.webp",
            "order": 3
        },
        {
            "fileName": "sweet-tangy-cherry-martini-recipes-for-cocktail-lovers_mollykitchendaily-main_image_4.webp",
            "filePath": "recipes/sweet-tangy-cherry-martini-recipes-for-cocktail-lovers/images/sweet-tangy-cherry-martini-recipes-for-cocktail-lovers_mollykitchendaily-main_image_4.webp",
            "relativePath": "sweet-tangy-cherry-martini-recipes-for-cocktail-lovers/images/sweet-tangy-cherry-martini-recipes-for-cocktail-lovers_mollykitchendaily-main_image_4.webp",
            "originalUrl": "http://localhost/SitePinterset/mollykitchendaily-main/recipes/sweet-tangy-cherry-martini-recipes-for-cocktail-lovers/images/sweet-tangy-cherry-martini-recipes-for-cocktail-lovers_mollykitchendaily-main_image_4.webp",
            "order": 4,
            "type": "template"
        }
    ],
    "slug": "sweet-tangy-cherry-martini-recipes-for-cocktail-lovers",
    "id": "recipe_1765644193_911",
    "image": "sweet-tangy-cherry-martini-recipes-for-cocktail-lovers_image_1.webp",
    "image_path": "recipes/sweet-tangy-cherry-martini-recipes-for-cocktail-lovers/images/sweet-tangy-cherry-martini-recipes-for-cocktail-lovers_image_1.webp",
    "image_dir": "sweet-tangy-cherry-martini-recipes-for-cocktail-lovers/images",
    "generated_from_text": true,
    "has_rich_structure": true,
    "createdAt": "2025-12-13T22:03:51+01:00",
    "updatedAt": "2025-12-13T22:03:51+01:00"
}