{
    "id": "text_recipe_1761588911_718",
    "slug": "air-fryer-egg-cheese-toast",
    "title": "Air Fryer Egg & Cheese Toast",
    "promptIMG": "Air Fryer Egg & Cheese Toast, on plate, natural food photography, balanced sharp focus, zero blur throughout entire image, infinite depth of field, realistic food textures, modern kitchen background in sharp focus, natural lighting, kitchen countertop visible, even focus distribution, documentary food photography, natural sharpness --no blur, depth of field, bokeh, over-sharpening, artificial enhancement --quality 2 --raw --stylize 300",
    "isOnline": true,
    "description": "Start your day with this quick and delicious Air Fryer Egg & Cheese Toast! It's crispy, satisfying, and perfect for busy mornings or brunch cravings.",
    "category_id": "cat_1761230422_512",
    "author_id": "author_001",
    "ingredients": [
        "2 slices of bread",
        "2 large eggs",
        "2 slices of cheese",
        "Salt and pepper to taste",
        "Butter or oil for greasing"
    ],
    "instructions": [
        "Preheat the air fryer to 350°F (175°C).",
        "Grease the air fryer basket with butter or oil.",
        "Place the slices of bread in the basket and crack an egg onto each slice.",
        "Top each egg with a slice of cheese and season with salt and pepper.",
        "Air fry for 5 minutes or until the egg is cooked to your liking."
    ],
    "prep_time": 10,
    "cook_time": 5,
    "total_time": 15,
    "servings": 2,
    "difficulty": "easy",
    "tips": "For a perfectly runny yolk, keep an eye on the cooking time and adjust as needed.",
    "structured_content": [
        {
            "content": "<p>Egg and cheese toast in the air fryer is so much easier than making it on the stove. No pan to clean, no flipping stuff around. Just put it in the air fryer and walk away for 5 minutes. Comes out crispy and perfect every time. I make this when I need breakfast fast but don't want cereal again.</p><p>The bread gets all toasty and crunchy on the bottom while the egg cooks on top. Then the cheese melts over everything. It's like breakfast heaven in 15 minutes total. My teenagers can even make this themselves which is a miracle. Anything they can make without me helping is a win.</p>"
        },
        {
            "note": {
                "label": "Why This Works",
                "content": "<ul><li>Done in 15 minutes which is faster than going through a drive thru</li><li>Tastes way better than microwaved breakfast sandwiches</li><li>Perfect for busy mornings when you're running late</li><li>Only needs bread, eggs, and cheese so it's cheap</li><li>You can add whatever else you want on top</li></ul>"
            }
        },
        {
            "content": "<p>First time I tried making eggs in the air fryer I thought it would be a disaster. Put the bread in, cracked the egg on top, and just hoped for the best. Came out perfect. Been making it this way ever since. Sometimes the simplest ideas are the best ones.</p>"
        },
        {
            "content": "<p>This is my go to breakfast on school mornings. Kids are running around getting ready, I'm trying to get out the door for work. This takes no brain power to make. Just throw it together and it's done before anyone's even looking for their shoes. Real breakfast without the stress.</p>"
        },
        {
            "headline": "What You Need"
        },
        {
            "content": "<ul><li><strong>Bread:</strong> Thicker bread works better than thin sandwich bread. Sourdough or Texas toast style. Needs to hold up the egg without getting too soggy.</li><li><strong>Eggs:</strong> Regular large eggs from the store. Nothing fancy. Room temperature eggs cook more evenly but I usually forget to take them out so cold works too.</li><li><strong>Cheese:</strong> American cheese melts the best but use whatever you have. Cheddar, Swiss, whatever's in your fridge. Sliced cheese is easier than shredded for this.</li><li><strong>Butter or oil:</strong> Just a little so the bread doesn't stick. I use cooking spray because it's faster.</li><li><strong>Air fryer:</strong> Obviously you need an air fryer. Any size works as long as the bread fits.</li></ul>"
        },
        {
            "content": "<p>Don't overthink the ingredients. I've made this with the cheapest white bread and it was fine. Fancy bread is nice but not necessary. Same with the cheese. Whatever you've got works. The whole point is quick and easy breakfast, not gourmet cooking.</p>"
        },
        {
            "upload": {
                "context": "A vibrant display of the ingredients for Air Fryer Egg & Cheese Toast, showcasing freshness and simplicity.",
                "url": "air-fryer-egg-cheese-toast/images/air-fryer-egg-cheese-toast_image_1.webp",
                "fileName": "air-fryer-egg-cheese-toast_image_1.webp",
                "type": "main"
            }
        },
        {
            "headline": "How to Make It"
        },
        {
            "content": "<dl><dt><strong>Getting ready:</strong></dt><dd>Turn on your air fryer to 350. Spray the basket with cooking spray or rub some butter in it. Get your bread and eggs ready. That's basically all the prep.</dd><dt><strong>Putting it together:</strong></dt><dd>Put the bread slices in the air fryer basket. Crack an egg right on top of each piece of bread. Try to keep the yolk in the middle but it's not a big deal if it moves. Put a slice of cheese on each egg. Sprinkle some salt and pepper. Close the air fryer and cook for 5 minutes. Check if the egg white is cooked. If not, give it another minute.</dd><dt><strong>Finishing up:</strong></dt><dd>Take it out carefully because it's hot. Let it cool for like 30 seconds. Eat it right away while it's still crispy.</dd></dl>"
        },
        {
            "content": "<p>The timing depends on how you like your eggs. If you want a runny yolk, do 5 minutes. If you want it fully cooked, go 6 or 7 minutes. I always do 5 because runny yolk is the best part. My kids want theirs fully cooked so I just leave theirs in longer. Everyone's happy.</p>"
        },
        {
            "upload": {
                "context": "Capturing the cooking process of Air Fryer Egg & Cheese Toast, highlighting the transformation of ingredients.",
                "url": "air-fryer-egg-cheese-toast/images/air-fryer-egg-cheese-toast_image_2.webp",
                "fileName": "air-fryer-egg-cheese-toast_image_2.webp",
                "type": "process"
            }
        },
        {
            "note": {
                "label": "Don't Forget",
                "content": "<ul><li>Make sure the egg white is fully cooked. Raw egg white is gross.</li><li>Don't put too many pieces in at once or they won't cook right.</li><li>Shake the basket gently to check if the egg is set.</li><li>This doesn't really keep well so just eat it fresh.</li><li>The bread gets soggy if you wait too long so eat it right away.</li></ul>"
            }
        },
        {
            "content": "<p>My kids request this every weekend now. They think I'm making them something special but really it's just the easiest breakfast I can think of. They feel like they're getting restaurant food. I feel like I'm barely cooking. Everybody wins.</p>"
        },
        {
            "content": "<p>Leftovers aren't really a thing with this. The bread gets soggy and the egg gets weird. Just make what you're gonna eat right then. Takes like 2 minutes to put together anyway so it's not like you're saving time by making extra. Fresh is always better with this one.</p>"
        },
        {
            "headline": "Making It Taste Better"
        },
        {
            "content": "<p>Hot sauce on top is really good. I put it on mine every time. That little kick of spice in the morning wakes you up. My husband uses sriracha. The kids won't touch it but more for us I guess.</p>"
        },
        {
            "content": "<p>Fresh herbs like chives or parsley are nice if you have them. Just sprinkle some on top after it's done. Makes it look fancy even though it took 5 minutes. I don't usually have fresh herbs though so this is optional.</p>"
        },
        {
            "content": "<p>Different cheese changes the whole thing. Try pepper jack for spicy. Mozzarella if you want it mild. I've even used cream cheese spread on the bread first which sounds weird but it's actually really good. Experiment with whatever's in your fridge.</p>"
        },
        {
            "headline": "What to Eat With It"
        },
        {
            "content": "<p>Fresh fruit on the side makes it feel like a real breakfast. Cut up some strawberries or throw some berries in a bowl. Takes 30 seconds and you get vitamins or whatever. Makes you feel less guilty about eating bread and cheese for breakfast.</p>"
        },
        {
            "content": "<p>Coffee is mandatory with this. At least for me. Toast and coffee is the classic combo. Sometimes I just drink orange juice if I'm trying to be healthy. Usually it's coffee though. Let's be real.</p>"
        },
        {
            "content": "<p>Honestly this is filling enough by itself. Two pieces of this toast and you're good until lunch. If you're super hungry add some bacon or sausage on the side. But usually the toast is plenty.</p>"
        },
        {
            "headline": "Different Ways to Do It"
        },
        {
            "content": "<p>Add bacon or ham under the egg for a meatier breakfast. Just put a cooked piece on the bread before you crack the egg. Basically makes it a breakfast sandwich without the top piece of bread. My husband does this every time.</p>"
        },
        {
            "content": "<p>For gluten free people, use gluten free bread. Works the same way. My friend with celiac makes it all the time and says it turns out fine. Bread is bread as far as the air fryer is concerned.</p>"
        },
        {
            "content": "<p>Vegans can use tofu and vegan cheese. Haven't tried it myself but I bet it works. The concept is the same. You're just putting different stuff on bread and air frying it. Hard to mess that up.</p>"
        },
        {
            "upload": {
                "context": "A beautifully plated Air Fryer Egg & Cheese Toast, showcasing its crispy texture and delicious toppings.",
                "url": "air-fryer-egg-cheese-toast/images/air-fryer-egg-cheese-toast_image_3.webp",
                "fileName": "air-fryer-egg-cheese-toast_image_3.webp",
                "type": "final"
            }
        },
        {
            "note": {
                "label": "Extra Stuff",
                "content": "<ul><li>Day old bread actually works better because it's drier.</li><li>Room temperature eggs cook more evenly but cold is fine too.</li><li>Watch it close the first time to figure out your air fryer timing.</li><li>Serve it right away or the bread gets soft.</li><li>Make one first to test before doing a bunch at once.</li></ul>"
            }
        },
        {
            "content": "<p>For meal prep you can't really do this ahead. The eggs need to be cooked fresh. But you can have all your stuff laid out ready to go. Bread on the counter, eggs next to the air fryer, cheese ready. Then it's super fast in the morning. As close to meal prep as you can get with this recipe.</p>"
        },
        {
            "content": "<p>If you're really in a hurry, skip the cheese. Just egg on toast still tastes good. Or use pre-shredded cheese instead of slices. Anything to save 10 seconds when you're running late. Sometimes good enough is better than perfect when you need to be out the door.</p>"
        },
        {
            "content": "<p>Air fryer egg and cheese toast is one of those things that sounds too simple to be good. But it works. Crispy bread, melted cheese, runny egg. Everything you want in breakfast without the hassle of cooking on the stove. Plus no pan to wash which might be the best part.</p>"
        },
        {
            "content": "<p>Try it tomorrow morning. Takes 15 minutes total and most of that is just waiting for the air fryer. Easy breakfast that actually tastes good and fills you up. That's really all you need on a busy morning. Simple food that works.</p>"
        }
    ],
    "images": [
        {
            "fileName": "air-fryer-egg-cheese-toast_image_1.webp",
            "filePath": "recipes/air-fryer-egg-cheese-toast/images/air-fryer-egg-cheese-toast_image_1.webp",
            "relativePath": "air-fryer-egg-cheese-toast/images/air-fryer-egg-cheese-toast_image_1.webp",
            "originalUrl": "http://localhost/SitePinterset/mollykitchendaily-main/tmpIMG/image_1.webp",
            "order": 1,
            "type": "main"
        },
        {
            "fileName": "air-fryer-egg-cheese-toast_image_2.webp",
            "filePath": "recipes/air-fryer-egg-cheese-toast/images/air-fryer-egg-cheese-toast_image_2.webp",
            "relativePath": "air-fryer-egg-cheese-toast/images/air-fryer-egg-cheese-toast_image_2.webp",
            "originalUrl": "http://localhost/SitePinterset/mollykitchendaily-main/tmpIMG/image_2.webp",
            "order": 2,
            "type": "process"
        },
        {
            "fileName": "air-fryer-egg-cheese-toast_image_3.webp",
            "filePath": "recipes/air-fryer-egg-cheese-toast/images/air-fryer-egg-cheese-toast_image_3.webp",
            "relativePath": "air-fryer-egg-cheese-toast/images/air-fryer-egg-cheese-toast_image_3.webp",
            "originalUrl": "http://localhost/SitePinterset/mollykitchendaily-main/tmpIMG/image_3.webp",
            "order": 3,
            "type": "final"
        },
        {
            "fileName": "air-fryer-egg-cheese-toast_image_4.webp",
            "filePath": "recipes/air-fryer-egg-cheese-toast/images/air-fryer-egg-cheese-toast_image_4.webp",
            "relativePath": "air-fryer-egg-cheese-toast/images/air-fryer-egg-cheese-toast_image_4.webp",
            "originalUrl": "http://localhost/SitePinterset/mollykitchendaily-main/recipes/air-fryer-egg-cheese-toast/images/air-fryer-egg-cheese-toast_image_4.webp",
            "order": 4,
            "type": "template"
        }
    ],
    "image": "air-fryer-egg-cheese-toast_image_1.webp",
    "image_path": "recipes/air-fryer-egg-cheese-toast/images/air-fryer-egg-cheese-toast_image_1.webp",
    "image_dir": "air-fryer-egg-cheese-toast/images",
    "generated_from_text": true,
    "has_rich_structure": true,
    "createdAt": "2025-10-27T19:15:11+01:00",
    "updatedAt": "2025-10-27T19:15:11+01:00"
}